onitake/aversive/include/aversive/parts/AT90PWM3.h
/* UCSRB */
#define TXB8_REG             UCSRB
#define RXB8_REG             UCSRB
#define UCSZ2_REG            UCSRB
#define TXEN_REG             UCSRB
#define RXEN_REG             UCSRB
#define UDRIE_REG            UCSRB
#define TXCIE_REG            UCSRB
#define RXCIE_REG            UCSRB

/* UCSRC */
#define UCPOL_REG            UCSRC
#define UCSZ0_REG            UCSRC
#define UCSZ1_REG            UCSRC
#define USBS_REG             UCSRC
#define UPM0_REG             UCSRC
#define UPM1_REG             UCSRC
#define UMSEL0_REG           UCSRC

/* ICR1L */
#define ICR1L0_REG           ICR1L
#define ICR1L1_REG           ICR1L
#define ICR1L2_REG           ICR1L
#define ICR1L3_REG           ICR1L
#define ICR1L4_REG           ICR1L
#define ICR1L5_REG           ICR1L
#define ICR1L6_REG           ICR1L
#define ICR1L7_REG           ICR1L

/* AC1CON */
#define AC1M0_REG            AC1CON
#define AC1M1_REG            AC1CON
#define AC1M2_REG            AC1CON
#define AC1ICE_REG           AC1CON
#define AC1IS0_REG           AC1CON
#define AC1IS1_REG           AC1CON
#define AC1IE_REG            AC1CON
#define AC1EN_REG            AC1CON

/* PRR */
#define PRADC_REG            PRR
#define PRUSART0_REG         PRR
#define PRSPI_REG            PRR
#define PRTIM0_REG           PRR
#define PRTIM1_REG           PRR
#define PRPSC0_REG           PRR
#define PRPSC1_REG           PRR
#define PRPSC2_REG           PRR

/* PCNF0 */
#define PCLKSEL0_REG         PCNF0
#define POP0_REG             PCNF0
#define PMODE00_REG          PCNF0
#define PMODE01_REG          PCNF0
#define PLOCK0_REG           PCNF0
#define PALOCK0_REG          PCNF0
#define PFIFTY0_REG          PCNF0

/* PCNF1 */
#define PCLKSEL1_REG         PCNF1
#define POP1_REG             PCNF1
#define PMODE10_REG          PCNF1
#define PMODE11_REG          PCNF1
#define PLOCK1_REG           PCNF1
#define PALOCK1_REG          PCNF1
#define PFIFTY1_REG          PCNF1

/* PCNF2 */
#define POME2_REG            PCNF2
#define PCLKSEL2_REG         PCNF2
#define POP2_REG             PCNF2
#define PMODE20_REG          PCNF2
#define PMODE21_REG          PCNF2
#define PLOCK2_REG           PCNF2
#define PALOCK2_REG          PCNF2
#define PFIFTY2_REG          PCNF2

/* TCNT1L */
#define TCNT1L0_REG          TCNT1L
#define TCNT1L1_REG          TCNT1L
#define TCNT1L2_REG          TCNT1L
#define TCNT1L3_REG          TCNT1L
#define TCNT1L4_REG          TCNT1L
#define TCNT1L5_REG          TCNT1L
#define TCNT1L6_REG          TCNT1L
#define TCNT1L7_REG          TCNT1L

/* PORTD */
#define PORTD0_REG           PORTD
#define PORTD1_REG           PORTD
#define PORTD2_REG           PORTD
#define PORTD3_REG           PORTD
#define PORTD4_REG           PORTD
#define PORTD5_REG           PORTD
#define PORTD6_REG           PORTD
#define PORTD7_REG           PORTD

/* PORTE */
#define PORTE0_REG           PORTE
#define PORTE1_REG           PORTE
#define PORTE2_REG           PORTE

/* TCNT1H */
#define TCNT1H0_REG          TCNT1H
#define TCNT1H1_REG          TCNT1H
#define TCNT1H2_REG          TCNT1H
#define TCNT1H3_REG          TCNT1H
#define TCNT1H4_REG          TCNT1H
#define TCNT1H5_REG          TCNT1H
#define TCNT1H6_REG          TCNT1H
#define TCNT1H7_REG          TCNT1H

/* PORTC */
#define PORTC0_REG           PORTC
#define PORTC1_REG           PORTC
#define PORTC2_REG           PORTC
#define PORTC3_REG           PORTC
#define PORTC4_REG           PORTC
#define PORTC5_REG           PORTC
#define PORTC6_REG           PORTC
#define PORTC7_REG           PORTC

/* AMP1CSR */
#define AMP1TS0_REG          AMP1CSR
#define AMP1TS1_REG          AMP1CSR
#define AMP1G0_REG           AMP1CSR
#define AMP1G1_REG           AMP1CSR
#define AMP1IS_REG           AMP1CSR
#define AMP1EN_REG           AMP1CSR

/* AC2CON */
#define AC2M0_REG            AC2CON
#define AC2M1_REG            AC2CON
#define AC2M2_REG            AC2CON
#define AC2IS0_REG           AC2CON
#define AC2IS1_REG           AC2CON
#define AC2IE_REG            AC2CON
#define AC2EN_REG            AC2CON

/* EIMSK */
#define INT0_REG             EIMSK
#define INT1_REG             EIMSK
#define INT2_REG             EIMSK
#define INT3_REG             EIMSK

/* PFRC0A */
#define PRFM0A0_REG          PFRC0A
#define PRFM0A1_REG          PFRC0A
#define PRFM0A2_REG          PFRC0A
#define PRFM0A3_REG          PFRC0A
#define PFLTE0A_REG          PFRC0A
#define PELEV0A_REG          PFRC0A
#define PISEL0A_REG          PFRC0A
#define PCAE0A_REG           PFRC0A

/* PFRC0B */
#define PRFM0B0_REG          PFRC0B
#define PRFM0B1_REG          PFRC0B
#define PRFM0B2_REG          PFRC0B
#define PRFM0B3_REG          PFRC0B
#define PFLTE0B_REG          PFRC0B
#define PELEV0B_REG          PFRC0B
#define PISEL0B_REG          PFRC0B
#define PCAE0B_REG           PFRC0B

/* PICR1H */
#define PICR1_8_REG          PICR1H
#define PICR1_9_REG          PICR1H
#define PICR1_10_REG         PICR1H
#define PICR1_11_REG         PICR1H

/* PICR1L */
#define PICR1_0_REG          PICR1L
#define PICR1_1_REG          PICR1L
#define PICR1_2_REG          PICR1L
#define PICR1_3_REG          PICR1L
#define PICR1_4_REG          PICR1L
#define PICR1_5_REG          PICR1L
#define PICR1_6_REG          PICR1L
#define PICR1_7_REG          PICR1L

/* EICRA */
#define ISC00_REG            EICRA
#define ISC01_REG            EICRA
#define ISC10_REG            EICRA
#define ISC11_REG            EICRA
#define ISC20_REG            EICRA
#define ISC21_REG            EICRA
#define ISC30_REG            EICRA
#define ISC31_REG            EICRA

/* DIDR0 */
#define ADC0D_REG            DIDR0
#define ADC1D_REG            DIDR0
#define ADC2D_REG            DIDR0
#define ADC3D_REG            DIDR0
#define ADC4D_REG            DIDR0
#define ADC5D_REG            DIDR0
#define ADC6D_REG            DIDR0
#define ADC7D_REG            DIDR0

/* DIDR1 */
#define ADC8D_REG            DIDR1
#define ADC9D_REG            DIDR1
#define ADC10D_REG           DIDR1
#define AMP0ND_REG           DIDR1
#define AMP0PD_REG           DIDR1
#define ACMP0D_REG           DIDR1

