onitake/aversive/include/aversive/parts/AT90PWM3.h
/* OCR1RAH */
#define OCR1RA_8_REG         OCR1RAH
#define OCR1RA_9_REG         OCR1RAH
#define OCR1RA_10_REG        OCR1RAH
#define OCR1RA_11_REG        OCR1RAH

/* OCR1RAL */
#define OCR1RA_0_REG         OCR1RAL
#define OCR1RA_1_REG         OCR1RAL
#define OCR1RA_2_REG         OCR1RAL
#define OCR1RA_3_REG         OCR1RAL
#define OCR1RA_4_REG         OCR1RAL
#define OCR1RA_5_REG         OCR1RAL
#define OCR1RA_6_REG         OCR1RAL
#define OCR1RA_7_REG         OCR1RAL

/* CLKPR */
#define CLKPS0_REG           CLKPR
#define CLKPS1_REG           CLKPR
#define CLKPS2_REG           CLKPR
#define CLKPS3_REG           CLKPR
#define CLKPCE_REG           CLKPR

/* OCR0RBH */
#define OCR0RB_8_REG         OCR0RBH
#define OCR0RB_9_REG         OCR0RBH
#define OCR0RB_00_REG        OCR0RBH
#define OCR0RB_01_REG        OCR0RBH
#define OCR0RB_02_REG        OCR0RBH
#define OCR0RB_03_REG        OCR0RBH
#define OCR0RB_04_REG        OCR0RBH
#define OCR0RB_05_REG        OCR0RBH

/* OCR0RBL */
#define OCR0RB_0_REG         OCR0RBL
#define OCR0RB_1_REG         OCR0RBL
#define OCR0RB_2_REG         OCR0RBL
#define OCR0RB_3_REG         OCR0RBL
#define OCR0RB_4_REG         OCR0RBL
#define OCR0RB_5_REG         OCR0RBL
#define OCR0RB_6_REG         OCR0RBL
#define OCR0RB_7_REG         OCR0RBL

/* DDRB */
#define DDB0_REG             DDRB
#define DDB1_REG             DDRB
#define DDB2_REG             DDRB
#define DDB3_REG             DDRB
#define DDB4_REG             DDRB
#define DDB5_REG             DDRB
#define DDB6_REG             DDRB
#define DDB7_REG             DDRB

/* SPMCSR */
#define SPMEN_REG            SPMCSR
#define PGERS_REG            SPMCSR
#define PGWRT_REG            SPMCSR
#define BLBSET_REG           SPMCSR
#define RWWSRE_REG           SPMCSR
#define RWWSB_REG            SPMCSR
#define SPMIE_REG            SPMCSR

/* TCCR1A */
#define WGM10_REG            TCCR1A
#define WGM11_REG            TCCR1A
#define COM1B0_REG           TCCR1A
#define COM1B1_REG           TCCR1A
#define COM1A0_REG           TCCR1A
#define COM1A1_REG           TCCR1A

/* TCCR1C */
#define FOC1B_REG            TCCR1C
#define FOC1A_REG            TCCR1C

/* TCCR1B */
#define CS10_REG             TCCR1B
#define CS11_REG             TCCR1B
#define CS12_REG             TCCR1B
#define WGM12_REG            TCCR1B
#define WGM13_REG            TCCR1B
#define ICES1_REG            TCCR1B
#define ICNC1_REG            TCCR1B

/* OSCCAL */
#define CAL0_REG             OSCCAL
#define CAL1_REG             OSCCAL
#define CAL2_REG             OSCCAL
#define CAL3_REG             OSCCAL
#define CAL4_REG             OSCCAL
#define CAL5_REG             OSCCAL
#define CAL6_REG             OSCCAL

/* OCR0RAL */
#define OCR0RA_0_REG         OCR0RAL
#define OCR0RA_1_REG         OCR0RAL
#define OCR0RA_2_REG         OCR0RAL
#define OCR0RA_3_REG         OCR0RAL
#define OCR0RA_4_REG         OCR0RAL
#define OCR0RA_5_REG         OCR0RAL
#define OCR0RA_6_REG         OCR0RAL
#define OCR0RA_7_REG         OCR0RAL

/* DDRD */
#define DDD0_REG             DDRD
#define DDD1_REG             DDRD
#define DDD2_REG             DDRD
#define DDD3_REG             DDRD
#define DDD4_REG             DDRD
#define DDD5_REG             DDRD
#define DDD6_REG             DDRD
#define DDD7_REG             DDRD

/* GPIOR1 */
#define GPIOR10_REG          GPIOR1
#define GPIOR11_REG          GPIOR1
#define GPIOR12_REG          GPIOR1
#define GPIOR13_REG          GPIOR1
#define GPIOR14_REG          GPIOR1
#define GPIOR15_REG          GPIOR1
#define GPIOR16_REG          GPIOR1
#define GPIOR17_REG          GPIOR1

/* GPIOR0 */
#define GPIOR00_REG          GPIOR0
#define GPIOR01_REG          GPIOR0
#define GPIOR02_REG          GPIOR0
#define GPIOR03_REG          GPIOR0
#define GPIOR04_REG          GPIOR0
#define GPIOR05_REG          GPIOR0
#define GPIOR06_REG          GPIOR0
#define GPIOR07_REG          GPIOR0

/* GPIOR3 */
#define GPIOR30_REG          GPIOR3
#define GPIOR31_REG          GPIOR3
#define GPIOR32_REG          GPIOR3
#define GPIOR33_REG          GPIOR3
#define GPIOR34_REG          GPIOR3
#define GPIOR35_REG          GPIOR3
#define GPIOR36_REG          GPIOR3
#define GPIOR37_REG          GPIOR3

/* GPIOR2 */
#define GPIOR20_REG          GPIOR2
#define GPIOR21_REG          GPIOR2
#define GPIOR22_REG          GPIOR2
#define GPIOR23_REG          GPIOR2
#define GPIOR24_REG          GPIOR2
#define GPIOR25_REG          GPIOR2
#define GPIOR26_REG          GPIOR2
#define GPIOR27_REG          GPIOR2

/* ADCL */
#define ADCL0_REG            ADCL
#define ADCL1_REG            ADCL
#define ADCL2_REG            ADCL
#define ADCL3_REG            ADCL
#define ADCL4_REG            ADCL
#define ADCL5_REG            ADCL
#define ADCL6_REG            ADCL
#define ADCL7_REG            ADCL

/* DDRE */
#define DDE0_REG             DDRE
#define DDE1_REG             DDRE
#define DDE2_REG             DDRE

/* TCNT0 */
#define TCNT0_0_REG          TCNT0
#define TCNT0_1_REG          TCNT0
#define TCNT0_2_REG          TCNT0
#define TCNT0_3_REG          TCNT0
#define TCNT0_4_REG          TCNT0
#define TCNT0_5_REG          TCNT0
#define TCNT0_6_REG          TCNT0
#define TCNT0_7_REG          TCNT0

/* TCCR0B */
#define CS00_REG             TCCR0B
#define CS01_REG             TCCR0B
#define CS02_REG             TCCR0B
#define WGM02_REG            TCCR0B
#define FOC0B_REG            TCCR0B
#define FOC0A_REG            TCCR0B

/* TCCR0A */
#define WGM00_REG            TCCR0A
#define WGM01_REG            TCCR0A
#define COM0B0_REG           TCCR0A
#define COM0B1_REG           TCCR0A
#define COM0A0_REG           TCCR0A
#define COM0A1_REG           TCCR0A

/* PFRC2B */
#define PRFM2B0_REG          PFRC2B
#define PRFM2B1_REG          PFRC2B
#define PRFM2B2_REG          PFRC2B
#define PRFM2B3_REG          PFRC2B
#define PFLTE2B_REG          PFRC2B
#define PELEV2B_REG          PFRC2B
#define PISEL2B_REG          PFRC2B
#define PCAE2B_REG           PFRC2B

/* PFRC2A */
#define PRFM2A0_REG          PFRC2A
#define PRFM2A1_REG          PFRC2A
#define PRFM2A2_REG          PFRC2A
#define PRFM2A3_REG          PFRC2A
#define PFLTE2A_REG          PFRC2A
#define PELEV2A_REG          PFRC2A
#define PISEL2A_REG          PFRC2A
#define PCAE2A_REG           PFRC2A

/* OCR2SAL */
#define OCR2SA_0_REG         OCR2SAL
#define OCR2SA_1_REG         OCR2SAL
#define OCR2SA_2_REG         OCR2SAL
#define OCR2SA_3_REG         OCR2SAL
#define OCR2SA_4_REG         OCR2SAL
#define OCR2SA_5_REG         OCR2SAL
#define OCR2SA_6_REG         OCR2SAL
#define OCR2SA_7_REG         OCR2SAL

