onitake/aversive/include/aversive/parts/AT90PWM3.h
/* EUCSRA */
#define URxS0_REG            EUCSRA
#define URxS1_REG            EUCSRA
#define URxS2_REG            EUCSRA
#define URxS3_REG            EUCSRA
#define UTxS0_REG            EUCSRA
#define UTxS1_REG            EUCSRA
#define UTxS2_REG            EUCSRA
#define UTxS3_REG            EUCSRA

/* EUCSRB */
#define BODR_REG             EUCSRB
#define EMCH_REG             EUCSRB
#define EUSBS_REG            EUCSRB
#define EUSART_REG           EUCSRB

/* EUCSRC */
#define STP0_REG             EUCSRC
#define STP1_REG             EUCSRC
#define F1617_REG            EUCSRC
#define FEM_REG              EUCSRC

/* PCTL0 */
#define PRUN0_REG            PCTL0
#define PCCYC0_REG           PCTL0
#define PARUN0_REG           PCTL0
#define PAOC0A_REG           PCTL0
#define PAOC0B_REG           PCTL0
#define PBFM0_REG            PCTL0
#define PPRE00_REG           PCTL0
#define PPRE01_REG           PCTL0

/* PCTL1 */
#define PRUN1_REG            PCTL1
#define PCCYC1_REG           PCTL1
#define PARUN1_REG           PCTL1
#define PAOC1A_REG           PCTL1
#define PAOC1B_REG           PCTL1
#define PBFM1_REG            PCTL1
#define PPRE10_REG           PCTL1
#define PPRE11_REG           PCTL1

/* PCTL2 */
#define PRUN2_REG            PCTL2
#define PCCYC2_REG           PCTL2
#define PARUN2_REG           PCTL2
#define PAOC2A_REG           PCTL2
#define PAOC2B_REG           PCTL2
#define PBFM2_REG            PCTL2
#define PPRE20_REG           PCTL2
#define PPRE21_REG           PCTL2

/* SPCR */
#define SPR0_REG             SPCR
#define SPR1_REG             SPCR
#define CPHA_REG             SPCR
#define CPOL_REG             SPCR
#define MSTR_REG             SPCR
#define DORD_REG             SPCR
#define SPE_REG              SPCR
#define SPIE_REG             SPCR

/* TIFR1 */
#define TOV1_REG             TIFR1
#define OCF1A_REG            TIFR1
#define OCF1B_REG            TIFR1
#define ICF1_REG             TIFR1

/* GTCCR */
#define PSR10_REG            GTCCR
#define ICPSEL1_REG          GTCCR
#define TSM_REG              GTCCR
#define PSRSYNC_REG          GTCCR

/* SPH */
#define SP8_REG              SPH
#define SP9_REG              SPH
#define SP10_REG             SPH
#define SP11_REG             SPH
#define SP12_REG             SPH
#define SP13_REG             SPH
#define SP14_REG             SPH
#define SP15_REG             SPH

/* POM2 */
#define POMV2A0_REG          POM2
#define POMV2A1_REG          POM2
#define POMV2A2_REG          POM2
#define POMV2A3_REG          POM2
#define POMV2B0_REG          POM2
#define POMV2B1_REG          POM2
#define POMV2B2_REG          POM2
#define POMV2B3_REG          POM2

/* OCR2RBL */
#define OCR2RB_0_REG         OCR2RBL
#define OCR2RB_1_REG         OCR2RBL
#define OCR2RB_2_REG         OCR2RBL
#define OCR2RB_3_REG         OCR2RBL
#define OCR2RB_4_REG         OCR2RBL
#define OCR2RB_5_REG         OCR2RBL
#define OCR2RB_6_REG         OCR2RBL
#define OCR2RB_7_REG         OCR2RBL

/* PICR2H */
#define PICR2_8_REG          PICR2H
#define PICR2_9_REG          PICR2H
#define PICR2_10_REG         PICR2H
#define PICR2_11_REG         PICR2H

/* OCR2RBH */
#define OCR2RB_8_REG         OCR2RBH
#define OCR2RB_9_REG         OCR2RBH
#define OCR2RB_10_REG        OCR2RBH
#define OCR2RB_11_REG        OCR2RBH
#define OCR2RB_12_REG        OCR2RBH
#define OCR2RB_13_REG        OCR2RBH
#define OCR2RB_14_REG        OCR2RBH
#define OCR2RB_15_REG        OCR2RBH

/* PICR2L */
#define PICR2_0_REG          PICR2L
#define PICR2_1_REG          PICR2L
#define PICR2_2_REG          PICR2L
#define PICR2_3_REG          PICR2L
#define PICR2_4_REG          PICR2L
#define PICR2_5_REG          PICR2L
#define PICR2_6_REG          PICR2L
#define PICR2_7_REG          PICR2L

/* OCR1BL */
#define OCR1BL0_REG          OCR1BL
#define OCR1BL1_REG          OCR1BL
#define OCR1BL2_REG          OCR1BL
#define OCR1BL3_REG          OCR1BL
#define OCR1BL4_REG          OCR1BL
#define OCR1BL5_REG          OCR1BL
#define OCR1BL6_REG          OCR1BL
#define OCR1BL7_REG          OCR1BL

/* OCR1BH */
#define OCR1BH0_REG          OCR1BH
#define OCR1BH1_REG          OCR1BH
#define OCR1BH2_REG          OCR1BH
#define OCR1BH3_REG          OCR1BH
#define OCR1BH4_REG          OCR1BH
#define OCR1BH5_REG          OCR1BH
#define OCR1BH6_REG          OCR1BH
#define OCR1BH7_REG          OCR1BH

/* SPL */
#define SP0_REG              SPL
#define SP1_REG              SPL
#define SP2_REG              SPL
#define SP3_REG              SPL
#define SP4_REG              SPL
#define SP5_REG              SPL
#define SP6_REG              SPL
#define SP7_REG              SPL

/* MCUSR */
#define PORF_REG             MCUSR
#define EXTRF_REG            MCUSR
#define BORF_REG             MCUSR
#define WDRF_REG             MCUSR

/* EECR */
#define EERE_REG             EECR
#define EEWE_REG             EECR
#define EEMWE_REG            EECR
#define EERIE_REG            EECR

/* SMCR */
#define SE_REG               SMCR
#define SM0_REG              SMCR
#define SM1_REG              SMCR
#define SM2_REG              SMCR

/* PLLCSR */
#define PLOCK_REG            PLLCSR
#define PLLE_REG             PLLCSR
#define PLLF_REG             PLLCSR

/* OCR2RAH */
#define OCR2RA_8_REG         OCR2RAH
#define OCR2RA_9_REG         OCR2RAH
#define OCR2RA_10_REG        OCR2RAH
#define OCR2RA_11_REG        OCR2RAH

/* OCR2RAL */
#define OCR2RA_0_REG         OCR2RAL
#define OCR2RA_1_REG         OCR2RAL
#define OCR2RA_2_REG         OCR2RAL
#define OCR2RA_3_REG         OCR2RAL
#define OCR2RA_4_REG         OCR2RAL
#define OCR2RA_5_REG         OCR2RAL
#define OCR2RA_6_REG         OCR2RAL
#define OCR2RA_7_REG         OCR2RAL

/* OCR0SAL */
#define OCR0SA_0_REG         OCR0SAL
#define OCR0SA_1_REG         OCR0SAL
#define OCR0SA_2_REG         OCR0SAL
#define OCR0SA_3_REG         OCR0SAL
#define OCR0SA_4_REG         OCR0SAL
#define OCR0SA_5_REG         OCR0SAL
#define OCR0SA_6_REG         OCR0SAL
#define OCR0SA_7_REG         OCR0SAL

/* OCR0SAH */
#define OCR0SA_8_REG         OCR0SAH
#define OCR0SA_9_REG         OCR0SAH
#define OCR0SA_00_REG        OCR0SAH
#define OCR0SA_01_REG        OCR0SAH

/* EEARH */
#define EEAR8_REG            EEARH
#define EEAR9_REG            EEARH
#define EEAR10_REG           EEARH
#define EEAR11_REG           EEARH

/* EEARL */
#define EEARL0_REG           EEARL
#define EEARL1_REG           EEARL
#define EEARL2_REG           EEARL
#define EEARL3_REG           EEARL
#define EEARL4_REG           EEARL
#define EEARL5_REG           EEARL
#define EEARL6_REG           EEARL
#define EEARL7_REG           EEARL

/* MCUCR */
#define IVCE_REG             MCUCR
#define IVSEL_REG            MCUCR
#define PUD_REG              MCUCR
#define SPIPS_REG            MCUCR

