onitake/aversive/include/aversive/parts/AT90PWM3.h
/* PICR0H */
#define PICR0_8_REG          PICR0H
#define PICR0_9_REG          PICR0H
#define PICR0_10_REG         PICR0H
#define PICR0_11_REG         PICR0H

/* EIFR */
#define INTF0_REG            EIFR
#define INTF1_REG            EIFR
#define INTF2_REG            EIFR
#define INTF3_REG            EIFR

/* MUBRRL */
#define MUBRR0_REG           MUBRRL
#define MUBRR1_REG           MUBRRL
#define MUBRR2_REG           MUBRRL
#define MUBRR3_REG           MUBRRL
#define MUBRR4_REG           MUBRRL
#define MUBRR5_REG           MUBRRL
#define MUBRR6_REG           MUBRRL
#define MUBRR7_REG           MUBRRL

/* MUBRRH */
#define MUBRR8_REG           MUBRRH
#define MUBRR9_REG           MUBRRH
#define MUBRR10_REG          MUBRRH
#define MUBRR11_REG          MUBRRH
#define MUBRR12_REG          MUBRRH
#define MUBRR13_REG          MUBRRH
#define MUBRR14_REG          MUBRRH
#define MUBRR15_REG          MUBRRH

/* OCR2SAH */
#define OCR2SA_8_REG         OCR2SAH
#define OCR2SA_9_REG         OCR2SAH
#define OCR2SA_10_REG        OCR2SAH
#define OCR2SA_11_REG        OCR2SAH

/* OCR0SBL */
#define OCR0SB_0_REG         OCR0SBL
#define OCR0SB_1_REG         OCR0SBL
#define OCR0SB_2_REG         OCR0SBL
#define OCR0SB_3_REG         OCR0SBL
#define OCR0SB_4_REG         OCR0SBL
#define OCR0SB_5_REG         OCR0SBL
#define OCR0SB_6_REG         OCR0SBL
#define OCR0SB_7_REG         OCR0SBL

/* OCR0SBH */
#define OCR0SB_8_REG         OCR0SBH
#define OCR0SB_9_REG         OCR0SBH
#define OCR0SB_00_REG        OCR0SBH
#define OCR0SB_01_REG        OCR0SBH

/* DDRC */
#define DDC0_REG             DDRC
#define DDC1_REG             DDRC
#define DDC2_REG             DDRC
#define DDC3_REG             DDRC
#define DDC4_REG             DDRC
#define DDC5_REG             DDRC
#define DDC6_REG             DDRC
#define DDC7_REG             DDRC

/* PFRC1B */
#define PRFM1B0_REG          PFRC1B
#define PRFM1B1_REG          PFRC1B
#define PRFM1B2_REG          PFRC1B
#define PRFM1B3_REG          PFRC1B
#define PFLTE1B_REG          PFRC1B
#define PELEV1B_REG          PFRC1B
#define PISEL1B_REG          PFRC1B
#define PCAE1B_REG           PFRC1B

/* PFRC1A */
#define PRFM1A0_REG          PFRC1A
#define PRFM1A1_REG          PFRC1A
#define PRFM1A2_REG          PFRC1A
#define PRFM1A3_REG          PFRC1A
#define PFLTE1A_REG          PFRC1A
#define PELEV1A_REG          PFRC1A
#define PISEL1A_REG          PFRC1A
#define PCAE1A_REG           PFRC1A

/* PICR0L */
#define PICR0_0_REG          PICR0L
#define PICR0_1_REG          PICR0L
#define PICR0_2_REG          PICR0L
#define PICR0_3_REG          PICR0L
#define PICR0_4_REG          PICR0L
#define PICR0_5_REG          PICR0L
#define PICR0_6_REG          PICR0L
#define PICR0_7_REG          PICR0L

/* OCR1SAL */
#define OCR1SA_0_REG         OCR1SAL
#define OCR1SA_1_REG         OCR1SAL
#define OCR1SA_2_REG         OCR1SAL
#define OCR1SA_3_REG         OCR1SAL
#define OCR1SA_4_REG         OCR1SAL
#define OCR1SA_5_REG         OCR1SAL
#define OCR1SA_6_REG         OCR1SAL
#define OCR1SA_7_REG         OCR1SAL

/* ADCSRA */
#define ADPS0_REG            ADCSRA
#define ADPS1_REG            ADCSRA
#define ADPS2_REG            ADCSRA
#define ADIE_REG             ADCSRA
#define ADIF_REG             ADCSRA
#define ADATE_REG            ADCSRA
#define ADSC_REG             ADCSRA
#define ADEN_REG             ADCSRA

/* PSOC0 */
#define POEN0A_REG           PSOC0
#define POEN0B_REG           PSOC0
#define PSYNC00_REG          PSOC0
#define PSYNC01_REG          PSOC0

/* PSOC1 */
#define POEN1A_REG           PSOC1
#define POEN1B_REG           PSOC1
#define PSYNC1_0_REG         PSOC1
#define PSYNC1_1_REG         PSOC1

/* OCR0A */
/* #define OCR0_0_REG           OCR0A */ /* dup in OCR0B */
/* #define OCR0_1_REG           OCR0A */ /* dup in OCR0B */
/* #define OCR0_2_REG           OCR0A */ /* dup in OCR0B */
/* #define OCR0_3_REG           OCR0A */ /* dup in OCR0B */
/* #define OCR0_4_REG           OCR0A */ /* dup in OCR0B */
/* #define OCR0_5_REG           OCR0A */ /* dup in OCR0B */
/* #define OCR0_6_REG           OCR0A */ /* dup in OCR0B */
/* #define OCR0_7_REG           OCR0A */ /* dup in OCR0B */

/* ACSR */
#define AC0O_REG             ACSR
#define AC1O_REG             ACSR
#define AC2O_REG             ACSR
#define AC0IF_REG            ACSR
#define AC1IF_REG            ACSR
#define AC2IF_REG            ACSR
#define ACCKDIV_REG          ACSR

/* OCR1RBL */
#define OCR1RB_0_REG         OCR1RBL
#define OCR1RB_1_REG         OCR1RBL
#define OCR1RB_2_REG         OCR1RBL
#define OCR1RB_3_REG         OCR1RBL
#define OCR1RB_4_REG         OCR1RBL
#define OCR1RB_5_REG         OCR1RBL
#define OCR1RB_6_REG         OCR1RBL
#define OCR1RB_7_REG         OCR1RBL

/* OCR1SBH */
#define OCR1SB_8_REG         OCR1SBH
#define OCR1SB_9_REG         OCR1SBH
#define OCR1SB_10_REG        OCR1SBH
#define OCR1SB_11_REG        OCR1SBH

/* OCR1RBH */
#define OCR1RB_8_REG         OCR1RBH
#define OCR1RB_9_REG         OCR1RBH
#define OCR1RB_10_REG        OCR1RBH
#define OCR1RB_11_REG        OCR1RBH
#define OCR1RB_12_REG        OCR1RBH
#define OCR1RB_13_REG        OCR1RBH
#define OCR1RB_14_REG        OCR1RBH
#define OCR1RB_15_REG        OCR1RBH

/* OCR1SBL */
#define OCR1SB_0_REG         OCR1SBL
#define OCR1SB_1_REG         OCR1SBL
#define OCR1SB_2_REG         OCR1SBL
#define OCR1SB_3_REG         OCR1SBL
#define OCR1SB_4_REG         OCR1SBL
#define OCR1SB_5_REG         OCR1SBL
#define OCR1SB_6_REG         OCR1SBL
#define OCR1SB_7_REG         OCR1SBL

/* OCR1SAH */
#define OCR1SA_8_REG         OCR1SAH
#define OCR1SA_9_REG         OCR1SAH
#define OCR1SA_10_REG        OCR1SAH
#define OCR1SA_11_REG        OCR1SAH

/* UBRRH */
#define UBRR8_REG            UBRRH
#define UBRR9_REG            UBRRH
#define UBRR10_REG           UBRRH
#define UBRR11_REG           UBRRH

/* DACL */
#define DACL0_REG            DACL
#define DACL1_REG            DACL
#define DACL2_REG            DACL
#define DACL3_REG            DACL
#define DACL4_REG            DACL
#define DACL5_REG            DACL
#define DACL6_REG            DACL
#define DACL7_REG            DACL

/* UBRRL */
#define UBRR0_REG            UBRRL
#define UBRR1_REG            UBRRL
#define UBRR2_REG            UBRRL
#define UBRR3_REG            UBRRL
#define UBRR4_REG            UBRRL
#define UBRR5_REG            UBRRL
#define UBRR6_REG            UBRRL
#define UBRR7_REG            UBRRL

/* DACH */
#define DACH0_REG            DACH
#define DACH1_REG            DACH
#define DACH2_REG            DACH
#define DACH3_REG            DACH
#define DACH4_REG            DACH
#define DACH5_REG            DACH
#define DACH6_REG            DACH
#define DACH7_REG            DACH

