onitake/aversive/include/aversive/parts/AT90PWM3.h
/* OCR0RAH */
#define OCR0RA_8_REG         OCR0RAH
#define OCR0RA_9_REG         OCR0RAH
#define OCR0RA_00_REG        OCR0RAH
#define OCR0RA_01_REG        OCR0RAH

/* PIM2 */
#define PEOPE2_REG           PIM2
#define PEVE2A_REG           PIM2
#define PEVE2B_REG           PIM2
#define PSEIE2_REG           PIM2

/* PIM0 */
#define PEOPE0_REG           PIM0
#define PEVE0A_REG           PIM0
#define PEVE0B_REG           PIM0
#define PSEIE0_REG           PIM0

/* PIM1 */
#define PEOPE1_REG           PIM1
#define PEVE1A_REG           PIM1
#define PEVE1B_REG           PIM1
#define PSEIE1_REG           PIM1

/* PIFR2 */
#define PEOP2_REG            PIFR2
#define PRN20_REG            PIFR2
#define PRN21_REG            PIFR2
#define PEV2A_REG            PIFR2
#define PEV2B_REG            PIFR2
#define PSEI2_REG            PIFR2

/* PORTB */
#define PORTB0_REG           PORTB
#define PORTB1_REG           PORTB
#define PORTB2_REG           PORTB
#define PORTB3_REG           PORTB
#define PORTB4_REG           PORTB
#define PORTB5_REG           PORTB
#define PORTB6_REG           PORTB
#define PORTB7_REG           PORTB

/* PIFR0 */
#define PEOP0_REG            PIFR0
#define PRN00_REG            PIFR0
#define PRN01_REG            PIFR0
#define PEV0A_REG            PIFR0
#define PEV0B_REG            PIFR0
#define PSEI0_REG            PIFR0

/* PIFR1 */
#define PEOP1_REG            PIFR1
#define PRN10_REG            PIFR1
#define PRN11_REG            PIFR1
#define PEV1A_REG            PIFR1
#define PEV1B_REG            PIFR1
#define PSEI1_REG            PIFR1

/* ADCH */
#define ADCH0_REG            ADCH
#define ADCH1_REG            ADCH
#define ADCH2_REG            ADCH
#define ADCH3_REG            ADCH
#define ADCH4_REG            ADCH
#define ADCH5_REG            ADCH
#define ADCH6_REG            ADCH
#define ADCH7_REG            ADCH

/* PSOC2 */
#define POEN2A_REG           PSOC2
#define POEN2C_REG           PSOC2
#define POEN2B_REG           PSOC2
#define POEN2D_REG           PSOC2
#define PSYNC2_0_REG         PSOC2
#define PSYNC2_1_REG         PSOC2
#define POS22_REG            PSOC2
#define POS23_REG            PSOC2

/* TIMSK0 */
#define TOIE0_REG            TIMSK0
#define OCIE0A_REG           TIMSK0
#define OCIE0B_REG           TIMSK0

/* TIMSK1 */
#define TOIE1_REG            TIMSK1
#define OCIE1A_REG           TIMSK1
#define OCIE1B_REG           TIMSK1
#define ICIE1_REG            TIMSK1

/* AMP0CSR */
#define AMP0TS0_REG          AMP0CSR
#define AMP0TS1_REG          AMP0CSR
#define AMP0G0_REG           AMP0CSR
#define AMP0G1_REG           AMP0CSR
#define AMP0IS_REG           AMP0CSR
#define AMP0EN_REG           AMP0CSR

/* UDR */
#define UDR0_REG             UDR
#define UDR1_REG             UDR
#define UDR2_REG             UDR
#define UDR3_REG             UDR
#define UDR4_REG             UDR
#define UDR5_REG             UDR
#define UDR6_REG             UDR
#define UDR7_REG             UDR

/* DACON */
#define DAEN_REG             DACON
#define DALA_REG             DACON
#define DATS0_REG            DACON
#define DATS1_REG            DACON
#define DATS2_REG            DACON
#define DAATE_REG            DACON

/* PINC */
#define PINC0_REG            PINC
#define PINC1_REG            PINC
#define PINC2_REG            PINC
#define PINC3_REG            PINC
#define PINC4_REG            PINC
#define PINC5_REG            PINC
#define PINC6_REG            PINC
#define PINC7_REG            PINC

/* PINB */
#define PINB0_REG            PINB
#define PINB1_REG            PINB
#define PINB2_REG            PINB
#define PINB3_REG            PINB
#define PINB4_REG            PINB
#define PINB5_REG            PINB
#define PINB6_REG            PINB
#define PINB7_REG            PINB

/* AC0CON */
#define AC0M0_REG            AC0CON
#define AC0M1_REG            AC0CON
#define AC0M2_REG            AC0CON
#define AC0IS0_REG           AC0CON
#define AC0IS1_REG           AC0CON
#define AC0IE_REG            AC0CON
#define AC0EN_REG            AC0CON

/* ADCSRB */
#define ADTS0_REG            ADCSRB
#define ADTS1_REG            ADCSRB
#define ADTS2_REG            ADCSRB
#define ADTS3_REG            ADCSRB
#define ADASCR_REG           ADCSRB
#define ADHSM_REG            ADCSRB

/* PINE */
#define PINE0_REG            PINE
#define PINE1_REG            PINE
#define PINE2_REG            PINE

/* PIND */
#define PIND0_REG            PIND
#define PIND1_REG            PIND
#define PIND2_REG            PIND
#define PIND3_REG            PIND
#define PIND4_REG            PIND
#define PIND5_REG            PIND
#define PIND6_REG            PIND
#define PIND7_REG            PIND

/* OCR1AH */
#define OCR1AH0_REG          OCR1AH
#define OCR1AH1_REG          OCR1AH
#define OCR1AH2_REG          OCR1AH
#define OCR1AH3_REG          OCR1AH
#define OCR1AH4_REG          OCR1AH
#define OCR1AH5_REG          OCR1AH
#define OCR1AH6_REG          OCR1AH
#define OCR1AH7_REG          OCR1AH

/* OCR1AL */
#define OCR1AL0_REG          OCR1AL
#define OCR1AL1_REG          OCR1AL
#define OCR1AL2_REG          OCR1AL
#define OCR1AL3_REG          OCR1AL
#define OCR1AL4_REG          OCR1AL
#define OCR1AL5_REG          OCR1AL
#define OCR1AL6_REG          OCR1AL
#define OCR1AL7_REG          OCR1AL

/* TIFR0 */
#define TOV0_REG             TIFR0
#define OCF0A_REG            TIFR0
#define OCF0B_REG            TIFR0

/* pins mapping */
#define MISO_PORT PORTB
#define MISO_BIT 0
#define PSCOUT20_PORT PORTB
#define PSCOUT20_BIT 0

#define MOSI_PORT PORTB
#define MOSI_BIT 1
#define PSCOUT21_PORT PORTB
#define PSCOUT21_BIT 1

#define ADC5_PORT PORTB
#define ADC5_BIT 2
#define INT1_PORT PORTB
#define INT1_BIT 2

#define AMP0-_PORT PORTB
#define AMP0-_BIT 3

#define AMP0+_PORT PORTB
#define AMP0+_BIT 4

#define ADC6_PORT PORTB
#define ADC6_BIT 5
#define INT2_PORT PORTB
#define INT2_BIT 5

#define ADC7_PORT PORTB
#define ADC7_BIT 6
#define PSCOUT11_PORT PORTB
#define PSCOUT11_BIT 6
#define ICP1B_PORT PORTB
#define ICP1B_BIT 6

#define ADC4_PORT PORTB
#define ADC4_BIT 7
#define PSCOUT01_PORT PORTB
#define PSCOUT01_BIT 7
#define SCK_PORT PORTB
#define SCK_BIT 7

#define INT3_PORT PORTC
#define INT3_BIT 0
#define PSCOUT10_PORT PORTC
#define PSCOUT10_BIT 0

#define PSCIN1_PORT PORTC
#define PSCIN1_BIT 1
#define OC1B_PORT PORTC
#define OC1B_BIT 1

#define T0_PORT PORTC
#define T0_BIT 2
#define PSCOUT22_PORT PORTC
#define PSCOUT22_BIT 2

#define T1_PORT PORTC
#define T1_BIT 3
#define PSCOUT23_PORT PORTC
#define PSCOUT23_BIT 3

#define ADC8_PORT PORTC
#define ADC8_BIT 4
#define AMP1-_PORT PORTC
#define AMP1-_BIT 4

